app/controllers/articles_controller.rb

INSERT INTO "articles" ("headline", "starred", "created_at", "updated_at", "uri") VALUES('https://www.reddit.com/r/todayilearned/comments/4mkv4m/til_the_larvae_of_the_planthopper_bug_is_the/', NULL, '2016-06-05 09:11:42', '2016-06-05 09:11:42', 'TIL The Larvae of the Planthopper bug is the first living thing discovered to have evolved mechanical gears. They''re located in its legs and enable it to jump at an acceleration of 400Gs in 2ms.')
---
  def star
  # TODO: Sanitize these inputs before putting them into the database.
    params[:starred].each do |headline, uri|
      a = Article.new
      # Probably should've named this "url" instead.
      a.uri = uri
      a.headline = headline
      a.save